app/Controllers/RolePermissionController.php

    public function index()
    {
        // Menetapkan judul
        $data['title'] = 'Manage Role Permissions';

        // Mengambil grup dan izin
        $groups = $this->groupModel->findAll();
        $permissions = $this->permissionModel->findAll();
---
SELECT *
FROM `auth_groups`
SELECT *
FROM `auth_permissions`