app/Controllers/RoleController.php

    public function index()
    {
        $data['roles'] = $this->groupModel->findAll();
---
SELECT *
FROM `auth_groups`

    public function store()
    {
        // Validasi input
        if (!$this->validate([
            'name' => 'required|min_length[3]|max_length[50]',
            'description' => 'permit_empty|max_length[255]',
        ])) {
            return redirect()->to('/admin/roles/create')->withInput()->with('errors', $this->validator->getErrors());
        }

        // Menyimpan data ke database
        $this->groupModel->insert([
            'name' => $this->request->getPost('name'),
            'description' => $this->request->getPost('description'),
        ]);
---
INSERT INTO `auth_groups` (`name`, `description`) VALUES ('Super Admin', 'segalaa')

    public function delete($id)
    {
        // Cek apakah role ada
        if (!$this->groupModel->find($id)) {
            return redirect()->to('/admin/roles')->with('error', 'Role not found');
        }

        $this->groupModel->delete($id);
---
SELECT *
FROM `auth_groups`
WHERE `auth_groups`.`id` = '5'
DELETE FROM `auth_groups`
WHERE `id` IN ('5')