app/Models/RolePermissionModel.php

    public function getPermissionsByRole($roleId)
    {
        return $this->db->table('auth_groups_permissions gp')
            ->join('auth_permissions p', 'gp.permission_id = p.id')
            ->where('gp.group_id', $roleId)
            ->select('p.id, p.name')
            ->get()->getResultArray();
---
SELECT `p`.`id`, `p`.`name`
FROM `auth_groups_permissions` `gp`
JOIN `auth_permissions` `p` ON `gp`.`permission_id` = `p`.`id`
WHERE `gp`.`group_id` = '1'